/**
	******************************************************************************
  * @file 	    main.c
  * @author 	  杭州朗迅科技有限公司
  * @version 		V2.0
  * @brief   		LCD12864实验
  ******************************************************************************                            
	* @brief  LCD12864接线说明
	* @param  SC32F5832  -> 	LCD12864
	*							PC6 	 -> 	 CN3-RS
	*							PC4 	 -> 	 CN3-RW
	*							PC3 	 -> 	 CN3-E
	*							PC7 	 -> 	 CN3-PSB
	*							PC15 	 -> 	 CN3-RST
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include <SC32F5832.h>
#include <DevInit.h>
#include "delay.h"
#include <KEY.h>
#include "LCD12864.h"

/*#define---------------------------------------------------------------------*/

/* Private functions declared ------------------------------------------------*/


int main()
{

	Device_Init();	//系统初始化
	lcd_clear();
	lcd_wstr(1,2,"朗迅科技");
	
	lcd_wstr(2,2,"LCD 案例");//由于汉字占两格空间，所以 LCD 后必须加一个空格  
													//使得 案例 对齐阵列，否则显示会乱码
	while(1)
	{
		
		Key_Ctrl(); //按键控制显示函数
		
	}
	
}
